Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:atdf="http://crownking/atdf" xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:name="PIC32CX1025SG41100" edc:arch="arm32bit" edc:procid="0x0000" atdf:architecture="CORTEX-M4" atdf:family="PIC32CX" edc:hasFreeze="false" edc:masksetid="SG003">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:minvoltage="1.71" edc:maxvoltage="3.63" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true"/>
  <edc:ArchDef edc:name="arm32bit" edc:desc="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv7m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:irq="-15" edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset"/>
    <edc:Interrupt edc:irq="-14" edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted"/>
    <edc:Interrupt edc:irq="-13" edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault"/>
    <edc:Interrupt edc:irq="-12" edc:cname="MemoryManagement" edc:desc="Memory Management, MPU mismatch, including Access Violation and No Match"/>
    <edc:Interrupt edc:irq="-11" edc:cname="BusFault" edc:desc="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
    <edc:Interrupt edc:irq="-10" edc:cname="UsageFault" edc:desc="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
    <edc:Interrupt edc:irq="-5" edc:cname="SVCall" edc:desc="System Service Call via SVC instruction"/>
    <edc:Interrupt edc:irq="-4" edc:cname="DebugMonitor" edc:desc="Debug Monitor"/>
    <edc:Interrupt edc:irq="-2" edc:cname="PendSV" edc:desc="Pendable request for system service"/>
    <edc:Interrupt edc:irq="-1" edc:cname="SysTick" edc:desc="System Tick Timer"/>
    <edc:Interrupt edc:irq="0" edc:cname="PM" edc:desc="Power Manager" ltx:memberofperipheral="PM"/>
    <edc:Interrupt edc:irq="1" edc:cname="MCLK" edc:desc="Main Clock" ltx:memberofperipheral="MCLK"/>
    <edc:Interrupt edc:irq="2" edc:cname="OSCCTRL_XOSC0" edc:desc="External Oscillator 0" ltx:memberofperipheral="OSCCTRL"/>
    <edc:Interrupt edc:irq="3" edc:cname="OSCCTRL_XOSC1" edc:desc="External Oscillator 1" ltx:memberofperipheral="OSCCTRL"/>
    <edc:Interrupt edc:irq="4" edc:cname="OSCCTRL_DFLL" edc:desc="Digital Frequency Locked Loop" ltx:memberofperipheral="OSCCTRL"/>
    <edc:Interrupt edc:irq="5" edc:cname="OSCCTRL_DPLL0" edc:desc="Digital Phase Locked Loop 0" ltx:memberofperipheral="OSCCTRL"/>
    <edc:Interrupt edc:irq="6" edc:cname="OSCCTRL_DPLL1" edc:desc="Digital Phase Locked Loop 1" ltx:memberofperipheral="OSCCTRL"/>
    <edc:Interrupt edc:irq="7" edc:cname="OSC32KCTRL" edc:desc="32Khz Oscillator Controller" ltx:memberofperipheral="OSC32KCTRL"/>
    <edc:Interrupt edc:irq="8" edc:cname="SUPC_OTHER" edc:desc="Suppyly controller" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="9" edc:cname="SUPC_BODDET" edc:desc="Brown Out Detection" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="10" edc:cname="WDT" edc:desc="Watch Dog Timer" ltx:memberofperipheral="WDT"/>
    <edc:Interrupt edc:irq="11" edc:cname="RTC" edc:desc="Real Time Counter" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:irq="12" edc:cname="EIC_EXTINT_0" edc:desc="EIC Channel 0" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="13" edc:cname="EIC_EXTINT_1" edc:desc="EIC Channel 1" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="14" edc:cname="EIC_EXTINT_2" edc:desc="EIC Channel 2" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="15" edc:cname="EIC_EXTINT_3" edc:desc="EIC Channel 3" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="16" edc:cname="EIC_EXTINT_4" edc:desc="EIC Channel 4" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="17" edc:cname="EIC_EXTINT_5" edc:desc="EIC Channel 5" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="18" edc:cname="EIC_EXTINT_6" edc:desc="EIC Channel 6" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="19" edc:cname="EIC_EXTINT_7" edc:desc="EIC Channel 7" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="20" edc:cname="EIC_EXTINT_8" edc:desc="EIC Channel 8" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="21" edc:cname="EIC_EXTINT_9" edc:desc="EIC Channel 9" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="22" edc:cname="EIC_EXTINT_10" edc:desc="EIC Channel 10" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="23" edc:cname="EIC_EXTINT_11" edc:desc="EIC Channel 11" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="24" edc:cname="EIC_EXTINT_12" edc:desc="EIC Channel 12" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="25" edc:cname="EIC_EXTINT_13" edc:desc="EIC Channel 13" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="26" edc:cname="EIC_EXTINT_14" edc:desc="EIC Channel 14" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="27" edc:cname="EIC_EXTINT_15" edc:desc="EIC Channel 15" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="28" edc:cname="FREQM" edc:desc="Frequency Meter" ltx:memberofperipheral="FREQM"/>
    <edc:Interrupt edc:irq="29" edc:cname="NVMCTRL_0" edc:desc="Non-Volatile Memory Controller" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:irq="30" edc:cname="NVMCTRL_1" edc:desc="NVMCTRL SmartEEPROM Interrupts" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:irq="31" edc:cname="DMAC_0" edc:desc="DMA Channel 0" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="32" edc:cname="DMAC_1" edc:desc="DMA Channel 1" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="33" edc:cname="DMAC_2" edc:desc="DMA Channel 2" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="34" edc:cname="DMAC_3" edc:desc="DMA Channel 3" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="35" edc:cname="DMAC_OTHER" edc:desc="DMA Channel 4..X" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="36" edc:cname="EVSYS_0" edc:desc="Event System Channel 0" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="37" edc:cname="EVSYS_1" edc:desc="Event System Channel 1" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="38" edc:cname="EVSYS_2" edc:desc="Event System Channel 2" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="39" edc:cname="EVSYS_3" edc:desc="Event System Channel 3" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="40" edc:cname="EVSYS_OTHER" edc:desc="Event System Channel 4..X" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="41" edc:cname="PAC" edc:desc="Peripheral Access Controller" ltx:memberofperipheral="PAC"/>
    <edc:Interrupt edc:irq="45" edc:cname="RAMECC" edc:desc="RAM Error Correction Code" ltx:memberofperipheral="RAMECC"/>
    <edc:Interrupt edc:irq="46" edc:cname="SERCOM0_0" edc:desc="Serial Communication Interface 0" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:irq="47" edc:cname="SERCOM0_1" edc:desc="Serial Communication Interface 0" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:irq="48" edc:cname="SERCOM0_2" edc:desc="Serial Communication Interface 0" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:irq="49" edc:cname="SERCOM0_OTHER" edc:desc="Serial Communication Interface 0" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:irq="50" edc:cname="SERCOM1_0" edc:desc="Serial Communication Interface 1" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:irq="51" edc:cname="SERCOM1_1" edc:desc="Serial Communication Interface 1" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:irq="52" edc:cname="SERCOM1_2" edc:desc="Serial Communication Interface 1" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:irq="53" edc:cname="SERCOM1_OTHER" edc:desc="Serial Communication Interface 1" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:irq="54" edc:cname="SERCOM2_0" edc:desc="Serial Communication Interface 2" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:irq="55" edc:cname="SERCOM2_1" edc:desc="Serial Communication Interface 2" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:irq="56" edc:cname="SERCOM2_2" edc:desc="Serial Communication Interface 2" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:irq="57" edc:cname="SERCOM2_OTHER" edc:desc="Serial Communication Interface 2" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:irq="58" edc:cname="SERCOM3_0" edc:desc="Serial Communication Interface 3" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:irq="59" edc:cname="SERCOM3_1" edc:desc="Serial Communication Interface 3" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:irq="60" edc:cname="SERCOM3_2" edc:desc="Serial Communication Interface 3" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:irq="61" edc:cname="SERCOM3_OTHER" edc:desc="Serial Communication Interface 3" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:irq="62" edc:cname="SERCOM4_0" edc:desc="Serial Communication Interface 4" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:irq="63" edc:cname="SERCOM4_1" edc:desc="Serial Communication Interface 4" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:irq="64" edc:cname="SERCOM4_2" edc:desc="Serial Communication Interface 4" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:irq="65" edc:cname="SERCOM4_OTHER" edc:desc="Serial Communication Interface 4" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:irq="66" edc:cname="SERCOM5_0" edc:desc="Serial Communication Interface 5" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:irq="67" edc:cname="SERCOM5_1" edc:desc="Serial Communication Interface 5" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:irq="68" edc:cname="SERCOM5_2" edc:desc="Serial Communication Interface 5" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:irq="69" edc:cname="SERCOM5_OTHER" edc:desc="Serial Communication Interface 5" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:irq="70" edc:cname="SERCOM6_0" edc:desc="Serial Communication Interface 6" ltx:memberofperipheral="SERCOM6"/>
    <edc:Interrupt edc:irq="71" edc:cname="SERCOM6_1" edc:desc="Serial Communication Interface 6" ltx:memberofperipheral="SERCOM6"/>
    <edc:Interrupt edc:irq="72" edc:cname="SERCOM6_2" edc:desc="Serial Communication Interface 6" ltx:memberofperipheral="SERCOM6"/>
    <edc:Interrupt edc:irq="73" edc:cname="SERCOM6_OTHER" edc:desc="Serial Communication Interface 6" ltx:memberofperipheral="SERCOM6"/>
    <edc:Interrupt edc:irq="74" edc:cname="SERCOM7_0" edc:desc="Serial Communication Interface 7" ltx:memberofperipheral="SERCOM7"/>
    <edc:Interrupt edc:irq="75" edc:cname="SERCOM7_1" edc:desc="Serial Communication Interface 7" ltx:memberofperipheral="SERCOM7"/>
    <edc:Interrupt edc:irq="76" edc:cname="SERCOM7_2" edc:desc="Serial Communication Interface 7" ltx:memberofperipheral="SERCOM7"/>
    <edc:Interrupt edc:irq="77" edc:cname="SERCOM7_OTHER" edc:desc="Serial Communication Interface 7" ltx:memberofperipheral="SERCOM7"/>
    <edc:Interrupt edc:irq="78" edc:cname="CAN0" edc:desc="Controller Area Network 0" ltx:memberofperipheral="CAN0"/>
    <edc:Interrupt edc:irq="79" edc:cname="CAN1" edc:desc="Controller Area Network 1" ltx:memberofperipheral="CAN1"/>
    <edc:Interrupt edc:irq="80" edc:cname="USB_OTHER" edc:desc="Universal Serial Bus" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:irq="81" edc:cname="USB_SOF_HSOF" edc:desc="USB Start of Frame" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:irq="82" edc:cname="USB_TRCPT0" edc:desc="USB Transfer Complete 0" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:irq="83" edc:cname="USB_TRCPT1" edc:desc="USB Transfer Complete 1" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:irq="84" edc:cname="GMAC" edc:desc="Ethernet MAC" ltx:memberofperipheral="GMAC"/>
    <edc:Interrupt edc:irq="85" edc:cname="TCC0_OTHER" edc:desc="Timer Counter Control 0" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:irq="86" edc:cname="TCC0_MC0" edc:desc="TCC Match/Compare 0" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:irq="87" edc:cname="TCC0_MC1" edc:desc="TCC Match/Compare 1" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:irq="88" edc:cname="TCC0_MC2" edc:desc="TCC Match/Compare 2" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:irq="89" edc:cname="TCC0_MC3" edc:desc="TCC Match/Compare 3" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:irq="90" edc:cname="TCC0_MC4" edc:desc="TCC Match/Compare 4" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:irq="91" edc:cname="TCC0_MC5" edc:desc="TCC Match/Compare 5" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:irq="92" edc:cname="TCC1_OTHER" edc:desc="Timer Counter Control 1" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:irq="93" edc:cname="TCC1_MC0" edc:desc="TCC Match/Compare 0" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:irq="94" edc:cname="TCC1_MC1" edc:desc="TCC Match/Compare 1" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:irq="95" edc:cname="TCC1_MC2" edc:desc="TCC Match/Compare 2" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:irq="96" edc:cname="TCC1_MC3" edc:desc="TCC Match/Compare 3" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:irq="97" edc:cname="TCC2_OTHER" edc:desc="Timer Counter Control 2" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:irq="98" edc:cname="TCC2_MC0" edc:desc="TCC Match/Compare 0" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:irq="99" edc:cname="TCC2_MC1" edc:desc="TCC Match/Compare 1" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:irq="100" edc:cname="TCC2_MC2" edc:desc="TCC Match/Compare 2" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:irq="101" edc:cname="TCC3_OTHER" edc:desc="Timer Counter Control 3" ltx:memberofperipheral="TCC3"/>
    <edc:Interrupt edc:irq="102" edc:cname="TCC3_MC0" edc:desc="TCC Match/Compare 0" ltx:memberofperipheral="TCC3"/>
    <edc:Interrupt edc:irq="103" edc:cname="TCC3_MC1" edc:desc="TCC Match/Compare 1" ltx:memberofperipheral="TCC3"/>
    <edc:Interrupt edc:irq="104" edc:cname="TCC4_OTHER" edc:desc="Timer Counter Control 4" ltx:memberofperipheral="TCC4"/>
    <edc:Interrupt edc:irq="105" edc:cname="TCC4_MC0" edc:desc="TCC Match/Compare 0" ltx:memberofperipheral="TCC4"/>
    <edc:Interrupt edc:irq="106" edc:cname="TCC4_MC1" edc:desc="TCC Match/Compare 1" ltx:memberofperipheral="TCC4"/>
    <edc:Interrupt edc:irq="107" edc:cname="TC0" edc:desc="Timer Counter 0" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="108" edc:cname="TC1" edc:desc="Timer Counter 1" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="109" edc:cname="TC2" edc:desc="Timer Counter 2" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="110" edc:cname="TC3" edc:desc="Timer Counter 3" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="111" edc:cname="TC4" edc:desc="Timer Counter 4" ltx:memberofperipheral="TC4"/>
    <edc:Interrupt edc:irq="112" edc:cname="TC5" edc:desc="Timer Counter 5" ltx:memberofperipheral="TC5"/>
    <edc:Interrupt edc:irq="113" edc:cname="TC6" edc:desc="Timer Counter 6" ltx:memberofperipheral="TC6"/>
    <edc:Interrupt edc:irq="114" edc:cname="TC7" edc:desc="Timer Counter 7" ltx:memberofperipheral="TC7"/>
    <edc:Interrupt edc:irq="115" edc:cname="PDEC_OTHER" edc:desc="Position Decoder" ltx:memberofperipheral="PDEC"/>
    <edc:Interrupt edc:irq="116" edc:cname="PDEC_MC0" edc:desc="PDEC Match/Compare 0" ltx:memberofperipheral="PDEC"/>
    <edc:Interrupt edc:irq="117" edc:cname="PDEC_MC1" edc:desc="PDEC Match Compare 1" ltx:memberofperipheral="PDEC"/>
    <edc:Interrupt edc:irq="118" edc:cname="ADC0_OTHER" edc:desc="Analog To Digital Converter 0" ltx:memberofperipheral="ADC0"/>
    <edc:Interrupt edc:irq="119" edc:cname="ADC0_RESRDY" edc:desc="ADC0 Result Ready" ltx:memberofperipheral="ADC0"/>
    <edc:Interrupt edc:irq="120" edc:cname="ADC1_OTHER" edc:desc="Analog To Digital Converter 1" ltx:memberofperipheral="ADC1"/>
    <edc:Interrupt edc:irq="121" edc:cname="ADC1_RESRDY" edc:desc="ADC1 Result Ready" ltx:memberofperipheral="ADC1"/>
    <edc:Interrupt edc:irq="122" edc:cname="AC" edc:desc="Analog Comparator" ltx:memberofperipheral="AC"/>
    <edc:Interrupt edc:irq="123" edc:cname="DAC_OTHER" edc:desc="Digital to Analog Converter" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:irq="124" edc:cname="DAC_EMPTY_0" edc:desc="DAC Buffer 0 Empty" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:irq="125" edc:cname="DAC_EMPTY_1" edc:desc="DAC Buffer 1 Empty" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:irq="126" edc:cname="DAC_RESRDY_0" edc:desc="DAC Filter 0 Result Ready" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:irq="127" edc:cname="DAC_RESRDY_1" edc:desc="DAC Filter 1 Result Ready" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:irq="128" edc:cname="I2S" edc:desc="Inter-IC Sound Interface" ltx:memberofperipheral="I2S"/>
    <edc:Interrupt edc:irq="129" edc:cname="PCC" edc:desc="Parallel Capture Controller" ltx:memberofperipheral="PCC"/>
    <edc:Interrupt edc:irq="130" edc:cname="AES" edc:desc="Advanced Encryption Standard" ltx:memberofperipheral="AES"/>
    <edc:Interrupt edc:irq="131" edc:cname="TRNG" edc:desc="True Random Generator" ltx:memberofperipheral="TRNG"/>
    <edc:Interrupt edc:irq="132" edc:cname="ICM" edc:desc="Integrity Check Monitor" ltx:memberofperipheral="ICM"/>
    <edc:Interrupt edc:irq="133" edc:cname="PUKCC" edc:desc="Public-Key Cryptography Controller" ltx:memberofperipheral="PUKCC"/>
    <edc:Interrupt edc:irq="134" edc:cname="QSPI" edc:desc="Quad SPI interface" ltx:memberofperipheral="QSPI"/>
    <edc:Interrupt edc:irq="135" edc:cname="SDHC0" edc:desc="SD/MMC Host Controller 0" ltx:memberofperipheral="SDHC0"/>
    <edc:Interrupt edc:irq="136" edc:cname="SDHC1" edc:desc="SD/MMC Host Controller 1" ltx:memberofperipheral="SDHC1"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="AC" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC0" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC1" edc:desc=""/>
    <edc:Peripheral edc:cname="AES" edc:desc=""/>
    <edc:Peripheral edc:cname="CAN0" edc:desc=""/>
    <edc:Peripheral edc:cname="CAN1" edc:desc=""/>
    <edc:Peripheral edc:cname="CCL" edc:desc=""/>
    <edc:Peripheral edc:cname="CMCC" edc:desc=""/>
    <edc:Peripheral edc:cname="DAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DSU" edc:desc=""/>
    <edc:Peripheral edc:cname="EIC" edc:desc=""/>
    <edc:Peripheral edc:cname="EVSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="FREQM" edc:desc=""/>
    <edc:Peripheral edc:cname="GCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="GMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="HMATRIX" edc:desc=""/>
    <edc:Peripheral edc:cname="ICM" edc:desc=""/>
    <edc:Peripheral edc:cname="I2S" edc:desc=""/>
    <edc:Peripheral edc:cname="MCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="NVMCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="OSCCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="OSC32KCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="PAC" edc:desc=""/>
    <edc:Peripheral edc:cname="PCC" edc:desc=""/>
    <edc:Peripheral edc:cname="PDEC" edc:desc=""/>
    <edc:Peripheral edc:cname="PM" edc:desc=""/>
    <edc:Peripheral edc:cname="PORT" edc:desc=""/>
    <edc:Peripheral edc:cname="PUKCC" edc:desc=""/>
    <edc:Peripheral edc:cname="QSPI" edc:desc=""/>
    <edc:Peripheral edc:cname="RAMECC" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="SDHC0" edc:desc=""/>
    <edc:Peripheral edc:cname="SDHC1" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM0" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM1" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM2" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM3" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM4" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM5" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM6" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM7" edc:desc=""/>
    <edc:Peripheral edc:cname="SUPC" edc:desc=""/>
    <edc:Peripheral edc:cname="TC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TC3" edc:desc=""/>
    <edc:Peripheral edc:cname="TC4" edc:desc=""/>
    <edc:Peripheral edc:cname="TC5" edc:desc=""/>
    <edc:Peripheral edc:cname="TC6" edc:desc=""/>
    <edc:Peripheral edc:cname="TC7" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC3" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC4" edc:desc=""/>
    <edc:Peripheral edc:cname="TRNG" edc:desc=""/>
    <edc:Peripheral edc:cname="USB" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
    <edc:Peripheral edc:cname="CoreDebug" edc:desc=""/>
    <edc:Peripheral edc:cname="DWT" edc:desc=""/>
    <edc:Peripheral edc:cname="ETM" edc:desc=""/>
    <edc:Peripheral edc:cname="FPU" edc:desc=""/>
    <edc:Peripheral edc:cname="ITM" edc:desc=""/>
    <edc:Peripheral edc:cname="MPU" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="SystemControl" edc:desc=""/>
    <edc:Peripheral edc:cname="TPIU" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R0" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="0"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R1" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="4"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R2" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="8"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R3" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="12"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R4" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="16"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R5" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="20"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R6" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="24"/>
