Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x40000C01"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="BKUPEXIT" edc:nzwidth="0x8" edc:access="r----rr-" edc:por="00000000" edc:mclr="00000000" edc:impl="0x86" edc:_addr="0x40000C02">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="Real Timer Counter Interrupt"/>
            <edc:SFRFieldDef edc:cname="BBPS" edc:nzwidth="0x1" edc:desc="Battery Backup Power Switch"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="HIB" edc:nzwidth="0x1" edc:desc="Hibernate"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FD" edc:_addr="0x40000C03"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40001000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="CFDEO0" edc:nzwidth="0x1" edc:desc="Clock 0 Failure Detector Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="CFDEO1" edc:nzwidth="0x1" edc:desc="Clock 1 Failure Detector Event Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40001001"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="----nnnn----nnnn---nnnnn----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0F1F0F" edc:_addr="0x40001004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY0" edc:nzwidth="0x1" edc:desc="XOSC 0 Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSCRDY1" edc:nzwidth="0x1" edc:desc="XOSC 1 Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL0" edc:nzwidth="0x1" edc:desc="XOSC 0 Clock Failure Detector Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL1" edc:nzwidth="0x1" edc:desc="XOSC 1 Clock Failure Detector Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:nzwidth="0x1" edc:desc="DFLL Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:nzwidth="0x1" edc:desc="DFLL Out Of Bounds Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:nzwidth="0x1" edc:desc="DFLL Lock Fine Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:nzwidth="0x1" edc:desc="DFLL Lock Coarse Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:nzwidth="0x1" edc:desc="DFLL Reference Clock Stopped Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLL0LCKR" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Rise Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL0LCKF" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Fall Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL0LTO" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Timeout Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL0LDRTO" edc:nzwidth="0x1" edc:desc="DPLL0 Loop Divider Ratio Update Complete Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DPLL1LCKR" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Rise Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL1LCKF" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Fall Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL1LTO" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Timeout Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL1LDRTO" edc:nzwidth="0x1" edc:desc="DPLL1 Loop Divider Ratio Update Complete Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="----nnnn----nnnn---nnnnn----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0F1F0F" edc:_addr="0x40001008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY0" edc:nzwidth="0x1" edc:desc="XOSC 0 Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSCRDY1" edc:nzwidth="0x1" edc:desc="XOSC 1 Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL0" edc:nzwidth="0x1" edc:desc="XOSC 0 Clock Failure Detector Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL1" edc:nzwidth="0x1" edc:desc="XOSC 1 Clock Failure Detector Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:nzwidth="0x1" edc:desc="DFLL Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:nzwidth="0x1" edc:desc="DFLL Out Of Bounds Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:nzwidth="0x1" edc:desc="DFLL Lock Fine Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:nzwidth="0x1" edc:desc="DFLL Lock Coarse Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:nzwidth="0x1" edc:desc="DFLL Reference Clock Stopped Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLL0LCKR" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Rise Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL0LCKF" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Fall Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL0LTO" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Timeout Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL0LDRTO" edc:nzwidth="0x1" edc:desc="DPLL0 Loop Divider Ratio Update Complete Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DPLL1LCKR" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Rise Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL1LCKF" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Fall Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL1LTO" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Timeout Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLL1LDRTO" edc:nzwidth="0x1" edc:desc="DPLL1 Loop Divider Ratio Update Complete Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="----nnnn----nnnn---nnnnn----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0F1F0F" edc:_addr="0x4000100C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY0" edc:nzwidth="0x1" edc:desc="XOSC 0 Ready"/>
            <edc:SFRFieldDef edc:cname="XOSCRDY1" edc:nzwidth="0x1" edc:desc="XOSC 1 Ready"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL0" edc:nzwidth="0x1" edc:desc="XOSC 0 Clock Failure Detector"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL1" edc:nzwidth="0x1" edc:desc="XOSC 1 Clock Failure Detector"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:nzwidth="0x1" edc:desc="DFLL Ready"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:nzwidth="0x1" edc:desc="DFLL Out Of Bounds"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:nzwidth="0x1" edc:desc="DFLL Lock Fine"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:nzwidth="0x1" edc:desc="DFLL Lock Coarse"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:nzwidth="0x1" edc:desc="DFLL Reference Clock Stopped"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLL0LCKR" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Rise"/>
            <edc:SFRFieldDef edc:cname="DPLL0LCKF" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Fall"/>
            <edc:SFRFieldDef edc:cname="DPLL0LTO" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Timeout"/>
            <edc:SFRFieldDef edc:cname="DPLL0LDRTO" edc:nzwidth="0x1" edc:desc="DPLL0 Loop Divider Ratio Update Complete"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DPLL1LCKR" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Rise"/>
            <edc:SFRFieldDef edc:cname="DPLL1LCKF" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Fall"/>
            <edc:SFRFieldDef edc:cname="DPLL1LTO" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Timeout"/>
            <edc:SFRFieldDef edc:cname="DPLL1LDRTO" edc:nzwidth="0x1" edc:desc="DPLL1 Loop Divider Ratio Update Complete"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="-----rrr-----rrr---rrrrr--rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7071F3F" edc:_addr="0x40001010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY0" edc:nzwidth="0x1" edc:desc="XOSC 0 Ready"/>
            <edc:SFRFieldDef edc:cname="XOSCRDY1" edc:nzwidth="0x1" edc:desc="XOSC 1 Ready"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL0" edc:nzwidth="0x1" edc:desc="XOSC 0 Clock Failure Detector"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL1" edc:nzwidth="0x1" edc:desc="XOSC 1 Clock Failure Detector"/>
            <edc:SFRFieldDef edc:cname="XOSCCKSW0" edc:nzwidth="0x1" edc:desc="XOSC 0 Clock Switch"/>
            <edc:SFRFieldDef edc:cname="XOSCCKSW1" edc:nzwidth="0x1" edc:desc="XOSC 1 Clock Switch"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:nzwidth="0x1" edc:desc="DFLL Ready"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:nzwidth="0x1" edc:desc="DFLL Out Of Bounds"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:nzwidth="0x1" edc:desc="DFLL Lock Fine"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:nzwidth="0x1" edc:desc="DFLL Lock Coarse"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:nzwidth="0x1" edc:desc="DFLL Reference Clock Stopped"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLL0LCKR" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Rise"/>
            <edc:SFRFieldDef edc:cname="DPLL0LCKF" edc:nzwidth="0x1" edc:desc="DPLL0 Lock Fall"/>
            <edc:SFRFieldDef edc:cname="DPLL0TO" edc:nzwidth="0x1" edc:desc="DPLL0 Timeout"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DPLL1LCKR" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Rise"/>
            <edc:SFRFieldDef edc:cname="DPLL1LCKF" edc:nzwidth="0x1" edc:desc="DPLL1 Lock Fall"/>
            <edc:SFRFieldDef edc:cname="DPLL1TO" edc:nzwidth="0x1" edc:desc="DPLL1 Timeout"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="XOSCCTRL0" edc:nzwidth="0x20" edc:access="----nnnnnnnn--nnnnnnnnnnnn---nn-" edc:por="00000000000000000000000010000000" edc:mclr="00000000000000000000000010000000" edc:impl="0xFF3FFC6" edc:_addr="0x40001014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="XTALEN" edc:nzwidth="0x1" edc:desc="Crystal Oscillator Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="LOWBUFGAIN" edc:nzwidth="0x1" edc:desc="Low Buffer Gain Enable"/>
            <edc:SFRFieldDef edc:cname="IPTAT" edc:nzwidth="0x2" edc:desc="Oscillator Current Reference"/>
            <edc:SFRFieldDef edc:cname="IMULT" edc:nzwidth="0x4" edc:desc="Oscillator Current Multiplier"/>
            <edc:SFRFieldDef edc:cname="ENALC" edc:nzwidth="0x1" edc:desc="Automatic Loop Control Enable"/>
            <edc:SFRFieldDef edc:cname="CFDEN" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Enable"/>
            <edc:SFRFieldDef edc:cname="SWBEN" edc:nzwidth="0x1" edc:desc="Xosc Clock Switch Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:nzwidth="0x4" edc:desc="Start-Up Time">
              <edc:SFRFieldSemantic edc:cname="CYCLE1" edc:desc="31 us" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE2" edc:desc="61 us" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4" edc:desc="122 us" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE8" edc:desc="244 us" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16" edc:desc="488 us" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32" edc:desc="977 us" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE64" edc:desc="1953 us" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE128" edc:desc="3906 us" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE256" edc:desc="7813 us" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE512" edc:desc="15625 us" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE1024" edc:desc="31250 us" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE2048" edc:desc="62500 us" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4096" edc:desc="125000 us" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE8192" edc:desc="250000 us" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16384" edc:desc="500000 us" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32768" edc:desc="1000000 us" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CFDPRESC" edc:nzwidth="0x4" edc:desc="Clock Failure Detector Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="48 MHz" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="24 MHz" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="12 MHz" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="6 MHz" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="3 MHz" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="1.5 MHz" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="0.75 MHz" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="0.3125 MHz" edc:when="(field &amp; 0xF) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="XOSCCTRL1" edc:nzwidth="0x20" edc:access="----nnnnnnnn--nnnnnnnnnnnn---nn-" edc:por="00000000000000000000000010000000" edc:mclr="00000000000000000000000010000000" edc:impl="0xFF3FFC6" edc:_addr="0x40001018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="XTALEN" edc:nzwidth="0x1" edc:desc="Crystal Oscillator Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="LOWBUFGAIN" edc:nzwidth="0x1" edc:desc="Low Buffer Gain Enable"/>
            <edc:SFRFieldDef edc:cname="IPTAT" edc:nzwidth="0x2" edc:desc="Oscillator Current Reference"/>
            <edc:SFRFieldDef edc:cname="IMULT" edc:nzwidth="0x4" edc:desc="Oscillator Current Multiplier"/>
            <edc:SFRFieldDef edc:cname="ENALC" edc:nzwidth="0x1" edc:desc="Automatic Loop Control Enable"/>
            <edc:SFRFieldDef edc:cname="CFDEN" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Enable"/>
            <edc:SFRFieldDef edc:cname="SWBEN" edc:nzwidth="0x1" edc:desc="Xosc Clock Switch Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:nzwidth="0x4" edc:desc="Start-Up Time">
              <edc:SFRFieldSemantic edc:cname="CYCLE1" edc:desc="31 us" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE2" edc:desc="61 us" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4" edc:desc="122 us" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE8" edc:desc="244 us" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16" edc:desc="488 us" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32" edc:desc="977 us" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE64" edc:desc="1953 us" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE128" edc:desc="3906 us" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE256" edc:desc="7813 us" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE512" edc:desc="15625 us" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE1024" edc:desc="31250 us" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE2048" edc:desc="62500 us" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4096" edc:desc="125000 us" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE8192" edc:desc="250000 us" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16384" edc:desc="500000 us" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32768" edc:desc="1000000 us" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CFDPRESC" edc:nzwidth="0x4" edc:desc="Clock Failure Detector Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="48 MHz" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="24 MHz" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="12 MHz" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="6 MHz" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="3 MHz" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="1.5 MHz" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="0.75 MHz" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="0.3125 MHz" edc:when="(field &amp; 0xF) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
