Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
      <edc:AdjustPoint edc:offset="0xD0" edc:_addr="0x41002020"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DCFG0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410020F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DCFG" edc:nzwidth="0x20" edc:desc="Device Configuration"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DCFG1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410020F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DCFG" edc:nzwidth="0x20" edc:desc="Device Configuration"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xF08" edc:_addr="0x410020F8"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="ENTRY0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrr----------rr" edc:por="10011111000011111100000000000010" edc:mclr="10011111000011111100000000000010" edc:impl="0xFFFFF003" edc:_addr="0x41003000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="EPRES" edc:nzwidth="0x1" edc:desc="Entry Present"/>
            <edc:SFRFieldDef edc:cname="FMT" edc:nzwidth="0x1" edc:desc="Format"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="ADDOFF" edc:nzwidth="0x14" edc:desc="Address Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="ENTRY1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41003004"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="END" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41003008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="END" edc:nzwidth="0x20" edc:desc="End Marker"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xFC0" edc:_addr="0x4100300C"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="MEMTYPE" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x41003FCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SMEMP" edc:nzwidth="0x1" edc:desc="System Memory Present"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID4" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x41003FD0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPCC" edc:nzwidth="0x4" edc:desc="JEP-106 Continuation Code"/>
            <edc:SFRFieldDef edc:cname="FKBC" edc:nzwidth="0x4" edc:desc="4KB count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41003FD4"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41003FD8"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41003FDC"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000011010000" edc:mclr="00000000000000000000000011010000" edc:impl="0xFF" edc:_addr="0x41003FE0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBL" edc:nzwidth="0x8" edc:desc="Part Number Low"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID1" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000011111100" edc:mclr="00000000000000000000000011111100" edc:impl="0xFF" edc:_addr="0x41003FE4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBH" edc:nzwidth="0x4" edc:desc="Part Number High"/>
            <edc:SFRFieldDef edc:cname="JEPIDCL" edc:nzwidth="0x4" edc:desc="Low part of the JEP-106 Identity Code"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID2" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000001001" edc:mclr="00000000000000000000000000001001" edc:impl="0xFF" edc:_addr="0x41003FE8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPIDCH" edc:nzwidth="0x3" edc:desc="JEP-106 Identity Code High"/>
            <edc:SFRFieldDef edc:cname="JEPU" edc:nzwidth="0x1" edc:desc="JEP-106 Identity Code is used"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Revision Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID3" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x41003FEC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="CUSMOD" edc:nzwidth="0x4" edc:desc="ARM CUSMOD"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:nzwidth="0x4" edc:desc="Revision Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CID0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000001101" edc:mclr="00000000000000000000000000001101" edc:impl="0xFF" edc:_addr="0x41003FF0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB0" edc:nzwidth="0x8" edc:desc="Preamble Byte 0"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CID1" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000010000" edc:mclr="00000000000000000000000000010000" edc:impl="0xFF" edc:_addr="0x41003FF4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLE" edc:nzwidth="0x4" edc:desc="Preamble"/>
            <edc:SFRFieldDef edc:cname="CCLASS" edc:nzwidth="0x4" edc:desc="Component Class"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CID2" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000101" edc:mclr="00000000000000000000000000000101" edc:impl="0xFF" edc:_addr="0x41003FF8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB2" edc:nzwidth="0x8" edc:desc="Preamble Byte 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CID3" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000010110001" edc:mclr="00000000000000000000000010110001" edc:impl="0xFF" edc:_addr="0x41003FFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB3" edc:nzwidth="0x8" edc:desc="Preamble Byte 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="CTRLA" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnn--" edc:por="0000000000000100" edc:mclr="0000000000000100" edc:impl="0xFFFC" edc:_addr="0x41004000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AUTOWS" edc:nzwidth="0x1" edc:desc="Auto Wait State Enable"/>
            <edc:SFRFieldDef edc:cname="SUSPEN" edc:nzwidth="0x1" edc:desc="Suspend Enable"/>
            <edc:SFRFieldDef edc:cname="WMODE" edc:nzwidth="0x2" edc:desc="Write Mode">
              <edc:SFRFieldSemantic edc:cname="MAN" edc:desc="Manual Write" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ADW" edc:desc="Automatic Double Word Write" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="AQW" edc:desc="Automatic Quad Word" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="AP" edc:desc="Automatic Page Write" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRM" edc:nzwidth="0x2" edc:desc="Power Reduction Mode during Sleep">
              <edc:SFRFieldSemantic edc:cname="SEMIAUTO" edc:desc="NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FULLAUTO" edc:desc="NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode when system is not in standby mode." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MANUAL" edc:desc="NVM block does not enter low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWS" edc:nzwidth="0x4" edc:desc="NVM Read Wait States"/>
            <edc:SFRFieldDef edc:cname="AHBNS0" edc:nzwidth="0x1" edc:desc="Force AHB0 access to NONSEQ, burst transfers are continuously rearbitrated"/>
            <edc:SFRFieldDef edc:cname="AHBNS1" edc:nzwidth="0x1" edc:desc="Force AHB1 access to NONSEQ, burst transfers are continuously rearbitrated"/>
            <edc:SFRFieldDef edc:cname="CACHEDIS0" edc:nzwidth="0x1" edc:desc="AHB0 Cache Disable"/>
            <edc:SFRFieldDef edc:cname="CACHEDIS1" edc:nzwidth="0x1" edc:desc="AHB1 Cache Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x41004002"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="CTRLB" edc:nzwidth="0x10" edc:access="wwwwwwww-wwwwwww" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFF7F" edc:_addr="0x41004004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x7" edc:desc="Command">
              <edc:SFRFieldSemantic edc:cname="EP" edc:desc="Erase Page - Only supported in the USER and AUX pages." edc:when="(field &amp; 0x7F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="EB" edc:desc="Erase Block - Erases the block addressed by the ADDR register, not supported in the user page" edc:when="(field &amp; 0x7F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WP" edc:desc="Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register, not supported in the user page" edc:when="(field &amp; 0x7F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="WQW" edc:desc="Write Quad Word - Writes a 128-bit word at the location addressed by the ADDR register." edc:when="(field &amp; 0x7F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SWRST" edc:desc="Software Reset - Power-Cycle the NVM memory and replay the device automatic calibration procedure and resets the module configuration registers" edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="LR" edc:desc="Lock Region - Locks the region containing the address location in the ADDR register." edc:when="(field &amp; 0x7F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="UR" edc:desc="Unlock Region - Unlocks the region containing the address location in the ADDR register." edc:when="(field &amp; 0x7F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="SPRM" edc:desc="Sets the power reduction mode." edc:when="(field &amp; 0x7F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="CPRM" edc:desc="Clears the power reduction mode." edc:when="(field &amp; 0x7F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="PBC" edc:desc="Page Buffer Clear - Clears the page buffer." edc:when="(field &amp; 0x7F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="SSB" edc:desc="Set Security Bit" edc:when="(field &amp; 0x7F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="BKSWRST" edc:desc="Bank swap and system reset, if SMEE is used also reallocate SMEE data into the opposite BANK" edc:when="(field &amp; 0x7F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="CELCK" edc:desc="Chip Erase Lock - DSU.CE command is not available" edc:when="(field &amp; 0x7F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="CEULCK" edc:desc="Chip Erase Unlock - DSU.CE command is available" edc:when="(field &amp; 0x7F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="SBPDIS" edc:desc="Sets STATUS.BPDIS, Boot loader protection is discarded until CBPDIS is issued or next start-up sequence" edc:when="(field &amp; 0x7F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="CBPDIS" edc:desc="Clears STATUS.BPDIS, Boot loader protection is not discarded" edc:when="(field &amp; 0x7F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="SCEHL" edc:desc="Set Chip Erase Hard Lock - DSU.CTRL.CE command is not available" edc:when="(field &amp; 0x7F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="SBPHL" edc:desc="Set Boot Protect Hard Lock" edc:when="(field &amp; 0x7F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="ASEES0" edc:desc="Activate SmartEEPROM Sector 0, deactivate Sector 1" edc:when="(field &amp; 0x7F) == 0x30"/>
              <edc:SFRFieldSemantic edc:cname="ASEES1" edc:desc="Activate SmartEEPROM Sector 1, deactivate Sector 0" edc:when="(field &amp; 0x7F) == 0x31"/>
              <edc:SFRFieldSemantic edc:cname="SEERALOC" edc:desc="Starts SmartEEPROM sector reallocation algorithm" edc:when="(field &amp; 0x7F) == 0x32"/>
              <edc:SFRFieldSemantic edc:cname="LSEE" edc:desc="Lock access to SmartEEPROM data from any mean" edc:when="(field &amp; 0x7F) == 0x34"/>
              <edc:SFRFieldSemantic edc:cname="USEE" edc:desc="Unlock access to SmartEEPROM data" edc:when="(field &amp; 0x7F) == 0x35"/>
              <edc:SFRFieldSemantic edc:cname="LSEER" edc:desc="Lock access to the SmartEEPROM Register Address Space (above 64KB)" edc:when="(field &amp; 0x7F) == 0x36"/>
              <edc:SFRFieldSemantic edc:cname="USEER" edc:desc="Unlock access to the SmartEEPROM Register Address Space (above 64KB)" edc:when="(field &amp; 0x7F) == 0x37"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMDEX" edc:nzwidth="0x8" edc:desc="Command Execution">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Execution Key" edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
