Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x41004006"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="PARAM" edc:nzwidth="0x20" edc:access="r------------rrrrrrrrrrrrrrrrrrr" edc:por="00000000000001100000000000000000" edc:mclr="00000000000001100000000000000000" edc:impl="0x8007FFFF" edc:_addr="0x41004008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="NVMP" edc:nzwidth="0x10" edc:desc="NVM Pages"/>
            <edc:SFRFieldDef edc:cname="PSZ" edc:nzwidth="0x3" edc:desc="Page Size">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="128" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="1024" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="SEE" edc:nzwidth="0x1" edc:desc="SmartEEPROM Supported">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="163840 bytes" edc:when="(field &amp; 0x1) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="9" edc:desc="147456 bytes" edc:when="(field &amp; 0x1) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="131072 bytes" edc:when="(field &amp; 0x1) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="7" edc:desc="114688 bytes" edc:when="(field &amp; 0x1) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="6" edc:desc="98304 bytes" edc:when="(field &amp; 0x1) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="5" edc:desc="81920 bytes" edc:when="(field &amp; 0x1) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="65536 bytes" edc:when="(field &amp; 0x1) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="3" edc:desc="49152 bytes" edc:when="(field &amp; 0x1) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="32768 bytes" edc:when="(field &amp; 0x1) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="16384 bytes" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="0 bytes" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTENCLR" edc:nzwidth="0x10" edc:access="-----nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x7FF" edc:_addr="0x4100400C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Command Done Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ADDRE" edc:nzwidth="0x1" edc:desc="Address Error"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:nzwidth="0x1" edc:desc="Programming Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:nzwidth="0x1" edc:desc="Lock Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ECCSE" edc:nzwidth="0x1" edc:desc="ECC Single Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ECCDE" edc:nzwidth="0x1" edc:desc="ECC Dual Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:nzwidth="0x1" edc:desc="NVM Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Suspended Write Or Erase Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SEESFULL" edc:nzwidth="0x1" edc:desc="Active SEES Full Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SEESOVF" edc:nzwidth="0x1" edc:desc="Active SEES Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SEEWRC" edc:nzwidth="0x1" edc:desc="SEE Write Completed Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTENSET" edc:nzwidth="0x10" edc:access="-----nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x7FF" edc:_addr="0x4100400E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Command Done Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ADDRE" edc:nzwidth="0x1" edc:desc="Address Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:nzwidth="0x1" edc:desc="Programming Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:nzwidth="0x1" edc:desc="Lock Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ECCSE" edc:nzwidth="0x1" edc:desc="ECC Single Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ECCDE" edc:nzwidth="0x1" edc:desc="ECC Dual Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:nzwidth="0x1" edc:desc="NVM Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Suspended Write Or Erase  Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SEESFULL" edc:nzwidth="0x1" edc:desc="Active SEES Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SEESOVF" edc:nzwidth="0x1" edc:desc="Active SEES Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SEEWRC" edc:nzwidth="0x1" edc:desc="SEE Write Completed Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
