Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="ECCERR" edc:nzwidth="0x20" edc:access="rrrr----rrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0FFFFFF" edc:_addr="0x41004024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x18" edc:desc="Error Address"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TYPEL" edc:nzwidth="0x2" edc:desc="Low Double-Word Error Type">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="At Least One Single Error Detected Since last Read" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUAL" edc:desc="At Least One Dual Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEH" edc:nzwidth="0x2" edc:desc="High Double-Word Error Type">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="At Least One Single Error Detected Since last Read" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUAL" edc:desc="At Least One Dual Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x41004028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:nzwidth="0x1" edc:desc="Debugger ECC Read Disable"/>
            <edc:SFRFieldDef edc:cname="ECCELOG" edc:nzwidth="0x1" edc:desc="Debugger ECC Error Tracking Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="BCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x41004029">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="BRPE" edc:nzwidth="0x1" edc:desc="Boot Read Protection Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="SEECFG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4100402A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="WMODE" edc:nzwidth="0x1" edc:desc="Write Mode">
              <edc:SFRFieldSemantic edc:cname="UNBUFFERED" edc:desc="A NVM write command is issued after each write in the pagebuffer" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="APRDIS" edc:nzwidth="0x1" edc:desc="Automatic Page Reallocation Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x4100402B"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="SEESTAT" edc:nzwidth="0x20" edc:access="-------------rrr----rrrr---rrr-r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x70F1D" edc:_addr="0x4100402C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ASEES" edc:nzwidth="0x1" edc:desc="Active SmartEEPROM Sector"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Busy"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="SmartEEPROM Write Access Is Locked"/>
            <edc:SFRFieldDef edc:cname="RLOCK" edc:nzwidth="0x1" edc:desc="SmartEEPROM Write Access To Register Address Space Is Locked"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SBLK" edc:nzwidth="0x4" edc:desc="Blocks Number In a Sector"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PSZ" edc:nzwidth="0x3" edc:desc="SmartEEPROM Page Size"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1FD0" edc:_addr="0x41004030"/>
      <edc:SFRDef ltx:memberofperipheral="CMCC" edc:cname="TYPE" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrr--r-" edc:por="00000000000000000001001011010010" edc:mclr="00000000000000000001001011010010" edc:impl="0x3FF2" edc:_addr="0x41006000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK" edc:nzwidth="0x1" edc:desc="dynamic Clock Gating supported"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RRP" edc:nzwidth="0x1" edc:desc="Round Robin Policy supported"/>
            <edc:SFRFieldDef edc:cname="WAYNUM" edc:nzwidth="0x2" edc:desc="Number of Way">
              <edc:SFRFieldSemantic edc:cname="ARCH4WAY" edc:desc="4-WAY set associative" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LCKDOWN" edc:nzwidth="0x1" edc:desc="Lock Down supported"/>
            <edc:SFRFieldDef edc:cname="CSIZE" edc:nzwidth="0x3" edc:desc="Cache Size">
              <edc:SFRFieldSemantic edc:cname="CSIZE_1KB" edc:desc="Cache Size is 1 KB" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_2KB" edc:desc="Cache Size is 2 KB" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_4KB" edc:desc="Cache Size is 4 KB" edc:when="(field &amp; 0x7) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLSIZE" edc:nzwidth="0x3" edc:desc="Cache Line Size">
              <edc:SFRFieldSemantic edc:cname="CLSIZE_16B" edc:desc="Cache Line Size is 16 bytes" edc:when="(field &amp; 0x7) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC" edc:cname="CFG" edc:nzwidth="0x20" edc:access="-------------------------nnn-nn-" edc:por="00000000000000000000000000100000" edc:mclr="00000000000000000000000000100000" edc:impl="0x76" edc:_addr="0x41006004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICDIS" edc:nzwidth="0x1" edc:desc="Instruction Cache Disable"/>
            <edc:SFRFieldDef edc:cname="DCDIS" edc:nzwidth="0x1" edc:desc="Data Cache Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CSIZESW" edc:nzwidth="0x3" edc:desc="Cache size configured by software">
              <edc:SFRFieldSemantic edc:cname="CONF_CSIZE_1KB" edc:desc="The Cache Size is configured to 1KB" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CONF_CSIZE_2KB" edc:desc="The Cache Size is configured to 2KB" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CONF_CSIZE_4KB" edc:desc="The Cache Size is configured to 4KB" edc:when="(field &amp; 0x7) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC" edc:cname="CTRL" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x41006008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Cache Controller Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC" edc:cname="SR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x4100600C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="CSTS" edc:nzwidth="0x1" edc:desc="Cache Controller Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
