Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXBCF" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420000DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="CF0" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 0"/>
            <edc:SFRFieldDef edc:cname="CF1" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 1"/>
            <edc:SFRFieldDef edc:cname="CF2" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 2"/>
            <edc:SFRFieldDef edc:cname="CF3" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 3"/>
            <edc:SFRFieldDef edc:cname="CF4" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 4"/>
            <edc:SFRFieldDef edc:cname="CF5" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 5"/>
            <edc:SFRFieldDef edc:cname="CF6" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 6"/>
            <edc:SFRFieldDef edc:cname="CF7" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 7"/>
            <edc:SFRFieldDef edc:cname="CF8" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 8"/>
            <edc:SFRFieldDef edc:cname="CF9" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 9"/>
            <edc:SFRFieldDef edc:cname="CF10" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 10"/>
            <edc:SFRFieldDef edc:cname="CF11" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 11"/>
            <edc:SFRFieldDef edc:cname="CF12" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 12"/>
            <edc:SFRFieldDef edc:cname="CF13" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 13"/>
            <edc:SFRFieldDef edc:cname="CF14" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 14"/>
            <edc:SFRFieldDef edc:cname="CF15" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 15"/>
            <edc:SFRFieldDef edc:cname="CF16" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 16"/>
            <edc:SFRFieldDef edc:cname="CF17" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 17"/>
            <edc:SFRFieldDef edc:cname="CF18" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 18"/>
            <edc:SFRFieldDef edc:cname="CF19" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 19"/>
            <edc:SFRFieldDef edc:cname="CF20" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 20"/>
            <edc:SFRFieldDef edc:cname="CF21" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 21"/>
            <edc:SFRFieldDef edc:cname="CF22" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 22"/>
            <edc:SFRFieldDef edc:cname="CF23" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 23"/>
            <edc:SFRFieldDef edc:cname="CF24" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 24"/>
            <edc:SFRFieldDef edc:cname="CF25" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 25"/>
            <edc:SFRFieldDef edc:cname="CF26" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 26"/>
            <edc:SFRFieldDef edc:cname="CF27" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 27"/>
            <edc:SFRFieldDef edc:cname="CF28" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 28"/>
            <edc:SFRFieldDef edc:cname="CF29" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 29"/>
            <edc:SFRFieldDef edc:cname="CF30" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 30"/>
            <edc:SFRFieldDef edc:cname="CF31" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXBTIE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420000E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TIE0" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 0"/>
            <edc:SFRFieldDef edc:cname="TIE1" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 1"/>
            <edc:SFRFieldDef edc:cname="TIE2" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 2"/>
            <edc:SFRFieldDef edc:cname="TIE3" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 3"/>
            <edc:SFRFieldDef edc:cname="TIE4" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 4"/>
            <edc:SFRFieldDef edc:cname="TIE5" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 5"/>
            <edc:SFRFieldDef edc:cname="TIE6" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 6"/>
            <edc:SFRFieldDef edc:cname="TIE7" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 7"/>
            <edc:SFRFieldDef edc:cname="TIE8" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 8"/>
            <edc:SFRFieldDef edc:cname="TIE9" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 9"/>
            <edc:SFRFieldDef edc:cname="TIE10" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 10"/>
            <edc:SFRFieldDef edc:cname="TIE11" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 11"/>
            <edc:SFRFieldDef edc:cname="TIE12" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 12"/>
            <edc:SFRFieldDef edc:cname="TIE13" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 13"/>
            <edc:SFRFieldDef edc:cname="TIE14" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 14"/>
            <edc:SFRFieldDef edc:cname="TIE15" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 15"/>
            <edc:SFRFieldDef edc:cname="TIE16" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 16"/>
            <edc:SFRFieldDef edc:cname="TIE17" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 17"/>
            <edc:SFRFieldDef edc:cname="TIE18" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 18"/>
            <edc:SFRFieldDef edc:cname="TIE19" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 19"/>
            <edc:SFRFieldDef edc:cname="TIE20" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 20"/>
            <edc:SFRFieldDef edc:cname="TIE21" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 21"/>
            <edc:SFRFieldDef edc:cname="TIE22" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 22"/>
            <edc:SFRFieldDef edc:cname="TIE23" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 23"/>
            <edc:SFRFieldDef edc:cname="TIE24" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 24"/>
            <edc:SFRFieldDef edc:cname="TIE25" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 25"/>
            <edc:SFRFieldDef edc:cname="TIE26" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 26"/>
            <edc:SFRFieldDef edc:cname="TIE27" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 27"/>
            <edc:SFRFieldDef edc:cname="TIE28" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 28"/>
            <edc:SFRFieldDef edc:cname="TIE29" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 29"/>
            <edc:SFRFieldDef edc:cname="TIE30" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 30"/>
            <edc:SFRFieldDef edc:cname="TIE31" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXBCIE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420000E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="CFIE0" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 0"/>
            <edc:SFRFieldDef edc:cname="CFIE1" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 1"/>
            <edc:SFRFieldDef edc:cname="CFIE2" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 2"/>
            <edc:SFRFieldDef edc:cname="CFIE3" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 3"/>
            <edc:SFRFieldDef edc:cname="CFIE4" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 4"/>
            <edc:SFRFieldDef edc:cname="CFIE5" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 5"/>
            <edc:SFRFieldDef edc:cname="CFIE6" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 6"/>
            <edc:SFRFieldDef edc:cname="CFIE7" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 7"/>
            <edc:SFRFieldDef edc:cname="CFIE8" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 8"/>
            <edc:SFRFieldDef edc:cname="CFIE9" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 9"/>
            <edc:SFRFieldDef edc:cname="CFIE10" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 10"/>
            <edc:SFRFieldDef edc:cname="CFIE11" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 11"/>
            <edc:SFRFieldDef edc:cname="CFIE12" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 12"/>
            <edc:SFRFieldDef edc:cname="CFIE13" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 13"/>
            <edc:SFRFieldDef edc:cname="CFIE14" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 14"/>
            <edc:SFRFieldDef edc:cname="CFIE15" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 15"/>
            <edc:SFRFieldDef edc:cname="CFIE16" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 16"/>
            <edc:SFRFieldDef edc:cname="CFIE17" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 17"/>
            <edc:SFRFieldDef edc:cname="CFIE18" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 18"/>
            <edc:SFRFieldDef edc:cname="CFIE19" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 19"/>
            <edc:SFRFieldDef edc:cname="CFIE20" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 20"/>
            <edc:SFRFieldDef edc:cname="CFIE21" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 21"/>
            <edc:SFRFieldDef edc:cname="CFIE22" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 22"/>
            <edc:SFRFieldDef edc:cname="CFIE23" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 23"/>
            <edc:SFRFieldDef edc:cname="CFIE24" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 24"/>
            <edc:SFRFieldDef edc:cname="CFIE25" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 25"/>
            <edc:SFRFieldDef edc:cname="CFIE26" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 26"/>
            <edc:SFRFieldDef edc:cname="CFIE27" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 27"/>
            <edc:SFRFieldDef edc:cname="CFIE28" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 28"/>
            <edc:SFRFieldDef edc:cname="CFIE29" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 29"/>
            <edc:SFRFieldDef edc:cname="CFIE30" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 30"/>
            <edc:SFRFieldDef edc:cname="CFIE31" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
