Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXESC" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:_addr="0x420004C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TBDS" edc:nzwidth="0x3" edc:desc="Tx Buffer Data Field Size">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXBRP" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420004CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TRP0" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 0"/>
            <edc:SFRFieldDef edc:cname="TRP1" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 1"/>
            <edc:SFRFieldDef edc:cname="TRP2" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 2"/>
            <edc:SFRFieldDef edc:cname="TRP3" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 3"/>
            <edc:SFRFieldDef edc:cname="TRP4" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 4"/>
            <edc:SFRFieldDef edc:cname="TRP5" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 5"/>
            <edc:SFRFieldDef edc:cname="TRP6" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 6"/>
            <edc:SFRFieldDef edc:cname="TRP7" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 7"/>
            <edc:SFRFieldDef edc:cname="TRP8" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 8"/>
            <edc:SFRFieldDef edc:cname="TRP9" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 9"/>
            <edc:SFRFieldDef edc:cname="TRP10" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 10"/>
            <edc:SFRFieldDef edc:cname="TRP11" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 11"/>
            <edc:SFRFieldDef edc:cname="TRP12" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 12"/>
            <edc:SFRFieldDef edc:cname="TRP13" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 13"/>
            <edc:SFRFieldDef edc:cname="TRP14" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 14"/>
            <edc:SFRFieldDef edc:cname="TRP15" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 15"/>
            <edc:SFRFieldDef edc:cname="TRP16" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 16"/>
            <edc:SFRFieldDef edc:cname="TRP17" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 17"/>
            <edc:SFRFieldDef edc:cname="TRP18" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 18"/>
            <edc:SFRFieldDef edc:cname="TRP19" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 19"/>
            <edc:SFRFieldDef edc:cname="TRP20" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 20"/>
            <edc:SFRFieldDef edc:cname="TRP21" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 21"/>
            <edc:SFRFieldDef edc:cname="TRP22" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 22"/>
            <edc:SFRFieldDef edc:cname="TRP23" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 23"/>
            <edc:SFRFieldDef edc:cname="TRP24" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 24"/>
            <edc:SFRFieldDef edc:cname="TRP25" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 25"/>
            <edc:SFRFieldDef edc:cname="TRP26" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 26"/>
            <edc:SFRFieldDef edc:cname="TRP27" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 27"/>
            <edc:SFRFieldDef edc:cname="TRP28" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 28"/>
            <edc:SFRFieldDef edc:cname="TRP29" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 29"/>
            <edc:SFRFieldDef edc:cname="TRP30" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 30"/>
            <edc:SFRFieldDef edc:cname="TRP31" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXBAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420004D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="AR0" edc:nzwidth="0x1" edc:desc="Add Request 0"/>
            <edc:SFRFieldDef edc:cname="AR1" edc:nzwidth="0x1" edc:desc="Add Request 1"/>
            <edc:SFRFieldDef edc:cname="AR2" edc:nzwidth="0x1" edc:desc="Add Request 2"/>
            <edc:SFRFieldDef edc:cname="AR3" edc:nzwidth="0x1" edc:desc="Add Request 3"/>
            <edc:SFRFieldDef edc:cname="AR4" edc:nzwidth="0x1" edc:desc="Add Request 4"/>
            <edc:SFRFieldDef edc:cname="AR5" edc:nzwidth="0x1" edc:desc="Add Request 5"/>
            <edc:SFRFieldDef edc:cname="AR6" edc:nzwidth="0x1" edc:desc="Add Request 6"/>
            <edc:SFRFieldDef edc:cname="AR7" edc:nzwidth="0x1" edc:desc="Add Request 7"/>
            <edc:SFRFieldDef edc:cname="AR8" edc:nzwidth="0x1" edc:desc="Add Request 8"/>
            <edc:SFRFieldDef edc:cname="AR9" edc:nzwidth="0x1" edc:desc="Add Request 9"/>
            <edc:SFRFieldDef edc:cname="AR10" edc:nzwidth="0x1" edc:desc="Add Request 10"/>
            <edc:SFRFieldDef edc:cname="AR11" edc:nzwidth="0x1" edc:desc="Add Request 11"/>
            <edc:SFRFieldDef edc:cname="AR12" edc:nzwidth="0x1" edc:desc="Add Request 12"/>
            <edc:SFRFieldDef edc:cname="AR13" edc:nzwidth="0x1" edc:desc="Add Request 13"/>
            <edc:SFRFieldDef edc:cname="AR14" edc:nzwidth="0x1" edc:desc="Add Request 14"/>
            <edc:SFRFieldDef edc:cname="AR15" edc:nzwidth="0x1" edc:desc="Add Request 15"/>
            <edc:SFRFieldDef edc:cname="AR16" edc:nzwidth="0x1" edc:desc="Add Request 16"/>
            <edc:SFRFieldDef edc:cname="AR17" edc:nzwidth="0x1" edc:desc="Add Request 17"/>
            <edc:SFRFieldDef edc:cname="AR18" edc:nzwidth="0x1" edc:desc="Add Request 18"/>
            <edc:SFRFieldDef edc:cname="AR19" edc:nzwidth="0x1" edc:desc="Add Request 19"/>
            <edc:SFRFieldDef edc:cname="AR20" edc:nzwidth="0x1" edc:desc="Add Request 20"/>
            <edc:SFRFieldDef edc:cname="AR21" edc:nzwidth="0x1" edc:desc="Add Request 21"/>
            <edc:SFRFieldDef edc:cname="AR22" edc:nzwidth="0x1" edc:desc="Add Request 22"/>
            <edc:SFRFieldDef edc:cname="AR23" edc:nzwidth="0x1" edc:desc="Add Request 23"/>
            <edc:SFRFieldDef edc:cname="AR24" edc:nzwidth="0x1" edc:desc="Add Request 24"/>
            <edc:SFRFieldDef edc:cname="AR25" edc:nzwidth="0x1" edc:desc="Add Request 25"/>
            <edc:SFRFieldDef edc:cname="AR26" edc:nzwidth="0x1" edc:desc="Add Request 26"/>
            <edc:SFRFieldDef edc:cname="AR27" edc:nzwidth="0x1" edc:desc="Add Request 27"/>
            <edc:SFRFieldDef edc:cname="AR28" edc:nzwidth="0x1" edc:desc="Add Request 28"/>
            <edc:SFRFieldDef edc:cname="AR29" edc:nzwidth="0x1" edc:desc="Add Request 29"/>
            <edc:SFRFieldDef edc:cname="AR30" edc:nzwidth="0x1" edc:desc="Add Request 30"/>
            <edc:SFRFieldDef edc:cname="AR31" edc:nzwidth="0x1" edc:desc="Add Request 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
