Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXEFA" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x420004F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="EFAI" edc:nzwidth="0x5" edc:desc="Event FIFO Acknowledge Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x304" edc:_addr="0x420004FC"/>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="NCR" edc:nzwidth="0x20" edc:access="------------nnnnn--nnnnnnnnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF9FFE" edc:_addr="0x42000800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LBL" edc:nzwidth="0x1" edc:desc="Loop Back Local"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receive Enable"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Transmit Enable"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:nzwidth="0x1" edc:desc="Management Port Enable"/>
            <edc:SFRFieldDef edc:cname="CLRSTAT" edc:nzwidth="0x1" edc:desc="Clear Statistics Registers"/>
            <edc:SFRFieldDef edc:cname="INCSTAT" edc:nzwidth="0x1" edc:desc="Increment Statistics Registers"/>
            <edc:SFRFieldDef edc:cname="WESTAT" edc:nzwidth="0x1" edc:desc="Write Enable for Statistics Registers"/>
            <edc:SFRFieldDef edc:cname="BP" edc:nzwidth="0x1" edc:desc="Back pressure"/>
            <edc:SFRFieldDef edc:cname="TSTART" edc:nzwidth="0x1" edc:desc="Start Transmission"/>
            <edc:SFRFieldDef edc:cname="THALT" edc:nzwidth="0x1" edc:desc="Transmit Halt"/>
            <edc:SFRFieldDef edc:cname="TXPF" edc:nzwidth="0x1" edc:desc="Transmit Pause Frame"/>
            <edc:SFRFieldDef edc:cname="TXZQPF" edc:nzwidth="0x1" edc:desc="Transmit Zero Quantum Pause Frame"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SRTSM" edc:nzwidth="0x1" edc:desc="Store Receive Time Stamp to Memory"/>
            <edc:SFRFieldDef edc:cname="ENPBPR" edc:nzwidth="0x1" edc:desc="Enable PFC Priority-based Pause Reception"/>
            <edc:SFRFieldDef edc:cname="TXPBPF" edc:nzwidth="0x1" edc:desc="Transmit PFC Priority-based Pause Frame"/>
            <edc:SFRFieldDef edc:cname="FNP" edc:nzwidth="0x1" edc:desc="Flush Next Packet"/>
            <edc:SFRFieldDef edc:cname="LPI" edc:nzwidth="0x1" edc:desc="Low Power Idle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="NCFGR" edc:nzwidth="0x20" edc:access="-nnn-nnnnnnnnnnnnnnn---nnnnnnnnn" edc:por="00000000000010000000000000000000" edc:mclr="00000000000010000000000000000000" edc:impl="0x77FFF1FF" edc:_addr="0x42000804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="SPD" edc:nzwidth="0x1" edc:desc="Speed"/>
            <edc:SFRFieldDef edc:cname="FD" edc:nzwidth="0x1" edc:desc="Full Duplex"/>
            <edc:SFRFieldDef edc:cname="DNVLAN" edc:nzwidth="0x1" edc:desc="Discard Non-VLAN FRAMES"/>
            <edc:SFRFieldDef edc:cname="JFRAME" edc:nzwidth="0x1" edc:desc="Jumbo Frame Size"/>
            <edc:SFRFieldDef edc:cname="CAF" edc:nzwidth="0x1" edc:desc="Copy All Frames"/>
            <edc:SFRFieldDef edc:cname="NBC" edc:nzwidth="0x1" edc:desc="No Broadcast"/>
            <edc:SFRFieldDef edc:cname="MTIHEN" edc:nzwidth="0x1" edc:desc="Multicast Hash Enable"/>
            <edc:SFRFieldDef edc:cname="UNIHEN" edc:nzwidth="0x1" edc:desc="Unicast Hash Enable"/>
            <edc:SFRFieldDef edc:cname="MAXFS" edc:nzwidth="0x1" edc:desc="1536 Maximum Frame Size"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTY" edc:nzwidth="0x1" edc:desc="Retry Test"/>
            <edc:SFRFieldDef edc:cname="PEN" edc:nzwidth="0x1" edc:desc="Pause Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFO" edc:nzwidth="0x2" edc:desc="Receive Buffer Offset"/>
            <edc:SFRFieldDef edc:cname="LFERD" edc:nzwidth="0x1" edc:desc="Length Field Error Frame Discard"/>
            <edc:SFRFieldDef edc:cname="RFCS" edc:nzwidth="0x1" edc:desc="Remove FCS"/>
            <edc:SFRFieldDef edc:cname="CLK" edc:nzwidth="0x3" edc:desc="MDC CLock Division">
              <edc:SFRFieldSemantic edc:cname="MCK8" edc:desc="MCK divided by 8" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MCK16" edc:desc="MCK divided by 16" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MCK32" edc:desc="MCK divided by 32" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="MCK48" edc:desc="MCK divided by 48" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="MCK64" edc:desc="MCK divided by 64" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="MCK96" edc:desc="MCK divided by 96" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DBW" edc:nzwidth="0x2" edc:desc="Data Bus Width"/>
            <edc:SFRFieldDef edc:cname="DCPF" edc:nzwidth="0x1" edc:desc="Disable Copy of Pause Frames"/>
            <edc:SFRFieldDef edc:cname="RXCOEN" edc:nzwidth="0x1" edc:desc="Receive Checksum Offload Enable"/>
            <edc:SFRFieldDef edc:cname="EFRHD" edc:nzwidth="0x1" edc:desc="Enable Frames Received in Half Duplex"/>
            <edc:SFRFieldDef edc:cname="IRXFCS" edc:nzwidth="0x1" edc:desc="Ignore RX FCS"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IPGSEN" edc:nzwidth="0x1" edc:desc="IP Stretch Enable"/>
            <edc:SFRFieldDef edc:cname="RXBP" edc:nzwidth="0x1" edc:desc="Receive Bad Preamble"/>
            <edc:SFRFieldDef edc:cname="IRXER" edc:nzwidth="0x1" edc:desc="Ignore IPG GRXER"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="NSR" edc:nzwidth="0x20" edc:access="-----------------------------rr-" edc:por="00000000000000000000000000000100" edc:mclr="00000000000000000000000000000100" edc:impl="0x6" edc:_addr="0x42000808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MDIO" edc:nzwidth="0x1" edc:desc="MDIO Input Status"/>
            <edc:SFRFieldDef edc:cname="IDLE" edc:nzwidth="0x1" edc:desc="PHY Management Logic Idle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
