Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="INTVECTV3" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002448">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="INTVECTV" edc:nzwidth="0x20" edc:desc="Initialization Vector Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x4200244C"/>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="HASHKEY0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200245C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="HASHKEY" edc:nzwidth="0x20" edc:desc="Hash Key Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="HASHKEY1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002460">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="HASHKEY" edc:nzwidth="0x20" edc:desc="Hash Key Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="HASHKEY2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002464">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="HASHKEY" edc:nzwidth="0x20" edc:desc="Hash Key Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="HASHKEY3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002468">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="HASHKEY" edc:nzwidth="0x20" edc:desc="Hash Key Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="GHASH0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200246C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="GHASH" edc:nzwidth="0x20" edc:desc="Galois Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="GHASH1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002470">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="GHASH" edc:nzwidth="0x20" edc:desc="Galois Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="GHASH2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002474">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="GHASH" edc:nzwidth="0x20" edc:desc="Galois Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="GHASH3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002478">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="GHASH" edc:nzwidth="0x20" edc:desc="Galois Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4200247C"/>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="CIPLEN" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002480">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="CIPLEN" edc:nzwidth="0x20" edc:desc="Cipher Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="RANDSEED" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002484">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="RANDSEED" edc:nzwidth="0x20" edc:desc="Random Seed"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x378" edc:_addr="0x42002488"/>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-n----n-" edc:por="00000000" edc:mclr="00000000" edc:impl="0x42" edc:_addr="0x42002800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
