Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="SWTRIG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x43001C14">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="FLUSH" edc:nzwidth="0x1" edc:desc="ADC Conversion Flush"/>
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Start ADC Conversion"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x17" edc:_addr="0x43001C15"/>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x43001C2C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:nzwidth="0x1" edc:desc="Result Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:nzwidth="0x1" edc:desc="Overrun Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:nzwidth="0x1" edc:desc="Window Monitor Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x43001C2D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:nzwidth="0x1" edc:desc="Result Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:nzwidth="0x1" edc:desc="Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:nzwidth="0x1" edc:desc="Window Monitor Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x43001C2E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:nzwidth="0x1" edc:desc="Result Ready Interrupt Flag"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:nzwidth="0x1" edc:desc="Overrun Interrupt Flag"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:nzwidth="0x1" edc:desc="Window Monitor Interrupt Flag"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="rrrrrr-r" edc:por="00000000" edc:mclr="00000000" edc:impl="0xFD" edc:_addr="0x43001C2F">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="ADCBUSY" edc:nzwidth="0x1" edc:desc="ADC Busy Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WCC" edc:nzwidth="0x6" edc:desc="Window Comparator Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x43001C30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="SWRST Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ENABLE Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:nzwidth="0x1" edc:desc="Input Control Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:nzwidth="0x1" edc:desc="Control B Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="REFCTRL" edc:nzwidth="0x1" edc:desc="Reference Control Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="AVGCTRL" edc:nzwidth="0x1" edc:desc="Average Control Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="SAMPCTRL" edc:nzwidth="0x1" edc:desc="Sampling Time Control Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:nzwidth="0x1" edc:desc="Window Monitor Lower Threshold Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:nzwidth="0x1" edc:desc="Window Monitor Upper Threshold Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:nzwidth="0x1" edc:desc="Gain Correction Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:nzwidth="0x1" edc:desc="Offset Correction Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="SWTRIG" edc:nzwidth="0x1" edc:desc="Software Trigger Synchronization Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="DSEQDATA" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43001C34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="DMA Sequential Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="DSEQCTRL" edc:nzwidth="0x20" edc:access="n----------------------nnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x800001FF" edc:_addr="0x43001C38">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:nzwidth="0x1" edc:desc="Input Control"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:nzwidth="0x1" edc:desc="Control B"/>
            <edc:SFRFieldDef edc:cname="REFCTRL" edc:nzwidth="0x1" edc:desc="Reference Control"/>
            <edc:SFRFieldDef edc:cname="AVGCTRL" edc:nzwidth="0x1" edc:desc="Average Control"/>
            <edc:SFRFieldDef edc:cname="SAMPCTRL" edc:nzwidth="0x1" edc:desc="Sampling Time Control"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:nzwidth="0x1" edc:desc="Window Monitor Lower Threshold"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:nzwidth="0x1" edc:desc="Window Monitor Upper Threshold"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:nzwidth="0x1" edc:desc="Gain Correction"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:nzwidth="0x1" edc:desc="Offset Correction"/>
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="AUTOSTART" edc:nzwidth="0x1" edc:desc="ADC Auto-Start Conversion"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="DSEQSTAT" edc:nzwidth="0x20" edc:access="r----------------------rrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x800001FF" edc:_addr="0x43001C3C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:nzwidth="0x1" edc:desc="Input Control"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:nzwidth="0x1" edc:desc="Control B"/>
            <edc:SFRFieldDef edc:cname="REFCTRL" edc:nzwidth="0x1" edc:desc="Reference Control"/>
            <edc:SFRFieldDef edc:cname="AVGCTRL" edc:nzwidth="0x1" edc:desc="Average Control"/>
            <edc:SFRFieldDef edc:cname="SAMPCTRL" edc:nzwidth="0x1" edc:desc="Sampling Time Control"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:nzwidth="0x1" edc:desc="Window Monitor Lower Threshold"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:nzwidth="0x1" edc:desc="Window Monitor Upper Threshold"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:nzwidth="0x1" edc:desc="Gain Correction"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:nzwidth="0x1" edc:desc="Offset Correction"/>
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="DMA Sequencing Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="RESULT" edc:nzwidth="0x10" edc:access="rrrrrrrrrrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x43001C40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="RESULT" edc:nzwidth="0x10" edc:desc="Result Conversion Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x43001C42"/>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="RESS" edc:nzwidth="0x10" edc:access="rrrrrrrrrrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x43001C44">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="RESS" edc:nzwidth="0x10" edc:desc="Last ADC conversion result"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x43001C46"/>
      <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CALIB" edc:nzwidth="0x10" edc:access="-----nnn-nnn-nnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x777" edc:_addr="0x43001C48">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="BIASCOMP" edc:nzwidth="0x3" edc:desc="Bias Comparator Scaling"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BIASR2R" edc:nzwidth="0x3" edc:desc="Bias R2R Ampli scaling"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BIASREFBUF" edc:nzwidth="0x3" edc:desc="Bias  Reference Buffer Scaling"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3B6" edc:_addr="0x43001C4A"/>
      <edc:SFRDef ltx:memberofperipheral="ADC1" edc:cname="CTRLA" edc:nzwidth="0x10" edc:access="n----nnnnnnnn-nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x87FB" edc:_addr="0x43002000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DUALSEL" edc:nzwidth="0x2" edc:desc="Dual Mode Trigger Selection">
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Start event or software trigger will start a conversion on both ADCs" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="INTERLEAVE" edc:desc="START event or software trigger will alternatingly start a conversion on ADC0 and ADC1" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLAVEEN" edc:nzwidth="0x1" edc:desc="Slave Enable"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0x3" edc:desc="Prescaler Configuration">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Peripheral clock divided by 2" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Peripheral clock divided by 4" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Peripheral clock divided by 8" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Peripheral clock divided by 16" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Peripheral clock divided by 32" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Peripheral clock divided by 64" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Peripheral clock divided by 128" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Peripheral clock divided by 256" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="R2R" edc:nzwidth="0x1" edc:desc="Rail to Rail Operation Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC1" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x43002002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="FLUSHEI" edc:nzwidth="0x1" edc:desc="Flush Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="STARTEI" edc:nzwidth="0x1" edc:desc="Start Conversion Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="FLUSHINV" edc:nzwidth="0x1" edc:desc="Flush Event Invert Enable"/>
            <edc:SFRFieldDef edc:cname="STARTINV" edc:nzwidth="0x1" edc:desc="Start Conversion Event Invert Enable"/>
            <edc:SFRFieldDef edc:cname="RESRDYEO" edc:nzwidth="0x1" edc:desc="Result Ready Event Out"/>
            <edc:SFRFieldDef edc:cname="WINMONEO" edc:nzwidth="0x1" edc:desc="Window Monitor Event Out"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC1" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x43002003">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Run"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
