Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/edc/PIC32CX1025SG41100.PIC
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPCFG7" edc:nzwidth="0x8" edc:access="nnnn-nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x410001E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPTYPE0" edc:nzwidth="0x3" edc:desc="End Point Type0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE1" edc:nzwidth="0x3" edc:desc="End Point Type1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:nzwidth="0x1" edc:desc="NYET Token Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPSTATUSCLR7" edc:nzwidth="0x8" edc:access="wwww-www" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x410001E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:nzwidth="0x1" edc:desc="Data Toggle OUT Clear"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:nzwidth="0x1" edc:desc="Data Toggle IN Clear"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:nzwidth="0x1" edc:desc="Stall 0 Request Clear"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:nzwidth="0x1" edc:desc="Stall 1 Request Clear"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Clear"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPSTATUSSET7" edc:nzwidth="0x8" edc:access="wwww-www" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x410001E5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:nzwidth="0x1" edc:desc="Data Toggle OUT Set"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:nzwidth="0x1" edc:desc="Data Toggle IN Set"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank Set"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:nzwidth="0x1" edc:desc="Stall 0 Request Set"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:nzwidth="0x1" edc:desc="Stall 1 Request Set"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Set"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPSTATUS7" edc:nzwidth="0x8" edc:access="rrrr-rrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x410001E6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:nzwidth="0x1" edc:desc="Data Toggle Out"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:nzwidth="0x1" edc:desc="Data Toggle In"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:nzwidth="0x1" edc:desc="Stall 0 Request"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:nzwidth="0x1" edc:desc="Stall 1 Request"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 ready"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPINTFLAG7" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:addr="0x410001E7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:nzwidth="0x1" edc:desc="Error Flow 0"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:nzwidth="0x1" edc:desc="Error Flow 1"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:nzwidth="0x1" edc:desc="Received Setup"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:nzwidth="0x1" edc:desc="Stall 0 In/out"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:nzwidth="0x1" edc:desc="Stall 1 In/out"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPINTENCLR7" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:addr="0x410001E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:nzwidth="0x1" edc:desc="Error Flow 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:nzwidth="0x1" edc:desc="Error Flow 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:nzwidth="0x1" edc:desc="Received Setup Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:nzwidth="0x1" edc:desc="Stall 0 In/Out Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:nzwidth="0x1" edc:desc="Stall 1 In/Out Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPINTENSET7" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:addr="0x410001E9">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:nzwidth="0x1" edc:desc="Error Flow 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:nzwidth="0x1" edc:desc="Error Flow 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:nzwidth="0x1" edc:desc="Received Setup Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:nzwidth="0x1" edc:desc="Stall 0 In/out Interrupt enable"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:nzwidth="0x1" edc:desc="Stall 1 In/out Interrupt enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="USB/HOST">
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="CTRLB" edc:nzwidth="0x10" edc:access="----nnnn-nnnnnn-" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF7E" edc:addr="0x41000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RESUME" edc:nzwidth="0x1" edc:desc="Send USB Resume"/>
            <edc:SFRFieldDef edc:cname="SPDCONF" edc:nzwidth="0x2" edc:desc="Speed Configuration for Host">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode: the host starts in full-speed mode and performs a high-speed reset to switch to the high speed mode if the downstream peripheral is high-speed capable." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FS" edc:desc="Full-speed: the host remains in full-speed mode whatever is the peripheral speed capability. Relevant in UTMI mode only." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTORESUME" edc:nzwidth="0x1" edc:desc="Auto Resume Enable"/>
            <edc:SFRFieldDef edc:cname="TSTJ" edc:nzwidth="0x1" edc:desc="Test mode J"/>
            <edc:SFRFieldDef edc:cname="TSTK" edc:nzwidth="0x1" edc:desc="Test mode K"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFE" edc:nzwidth="0x1" edc:desc="Start of Frame Generation Enable"/>
            <edc:SFRFieldDef edc:cname="BUSRESET" edc:nzwidth="0x1" edc:desc="Send USB Reset"/>
            <edc:SFRFieldDef edc:cname="VBUSOK" edc:nzwidth="0x1" edc:desc="VBUS is OK"/>
            <edc:SFRFieldDef edc:cname="L1RESUME" edc:nzwidth="0x1" edc:desc="Send L1 Resume"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="HSOFC" edc:nzwidth="0x8" edc:access="n---nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x8F" edc:addr="0x4100000A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="FLENC" edc:nzwidth="0x4" edc:desc="Frame Length Control"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FLENCE" edc:nzwidth="0x1" edc:desc="Frame Length Control Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="nn--nn--" edc:por="00000000" edc:mclr="00000000" edc:impl="0xCC" edc:addr="0x4100000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x2" edc:desc="Speed Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINESTATE" edc:nzwidth="0x2" edc:desc="USB Line State Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="FNUM" edc:nzwidth="0x10" edc:access="--nnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FFF" edc:addr="0x41000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="MFNUM" edc:nzwidth="0x3" edc:desc="Micro Frame Number"/>
            <edc:SFRFieldDef edc:cname="FNUM" edc:nzwidth="0xB" edc:desc="Frame Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="FLENHIGH" edc:nzwidth="0x8" edc:access="rrrrrrrr" edc:por="00000000" edc:mclr="00000000" edc:addr="0x41000012">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="FLENHIGH" edc:nzwidth="0x8" edc:desc="Frame Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="INTENCLR" edc:nzwidth="0x10" edc:access="------nnnnnnnn--" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FC" edc:addr="0x41000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HSOF" edc:nzwidth="0x1" edc:desc="Host Start Of Frame Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RST" edc:nzwidth="0x1" edc:desc="BUS Reset Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Wake Up Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DNRSM" edc:nzwidth="0x1" edc:desc="DownStream to Device Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume from Device Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:nzwidth="0x1" edc:desc="Ram Access Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DCONN" edc:nzwidth="0x1" edc:desc="Device Connection Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DDISC" edc:nzwidth="0x1" edc:desc="Device Disconnection Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="INTENSET" edc:nzwidth="0x10" edc:access="------nnnnnnnn--" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FC" edc:addr="0x41000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HSOF" edc:nzwidth="0x1" edc:desc="Host Start Of Frame Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RST" edc:nzwidth="0x1" edc:desc="Bus Reset Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Wake Up Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DNRSM" edc:nzwidth="0x1" edc:desc="DownStream to the Device Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume fromthe device Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:nzwidth="0x1" edc:desc="Ram Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DCONN" edc:nzwidth="0x1" edc:desc="Link Power Management Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DDISC" edc:nzwidth="0x1" edc:desc="Device Disconnection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="INTFLAG" edc:nzwidth="0x10" edc:access="------nnnnnnnn--" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FC" edc:addr="0x4100001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HSOF" edc:nzwidth="0x1" edc:desc="Host Start Of Frame"/>
            <edc:SFRFieldDef edc:cname="RST" edc:nzwidth="0x1" edc:desc="Bus Reset"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Wake Up"/>
            <edc:SFRFieldDef edc:cname="DNRSM" edc:nzwidth="0x1" edc:desc="Downstream"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume from the Device"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:nzwidth="0x1" edc:desc="Ram Access"/>
            <edc:SFRFieldDef edc:cname="DCONN" edc:nzwidth="0x1" edc:desc="Device Connection"/>
            <edc:SFRFieldDef edc:cname="DDISC" edc:nzwidth="0x1" edc:desc="Device Disconnection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PINTSMRY" edc:nzwidth="0x10" edc:access="--------rrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFF" edc:addr="0x41000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPINT0" edc:nzwidth="0x1" edc:desc="Pipe 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT1" edc:nzwidth="0x1" edc:desc="Pipe 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT2" edc:nzwidth="0x1" edc:desc="Pipe 2 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT3" edc:nzwidth="0x1" edc:desc="Pipe 3 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT4" edc:nzwidth="0x1" edc:desc="Pipe 4 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT5" edc:nzwidth="0x1" edc:desc="Pipe 5 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT6" edc:nzwidth="0x1" edc:desc="Pipe 6 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT7" edc:nzwidth="0x1" edc:desc="Pipe 7 Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
